hoshinoht/forest-link-protocol/flp-node/sdkconfig.defaults.esp32s3
# LilyGo T3-S3 (ESP32-S3 + SX1276 LoRa + SSD1306 OLED)

CONFIG_IDF_TARGET="esp32s3"

# Flash — 16MB, DIO mode, 80MHz
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Use ROM flash driver — the T3-S3 flash chip may fail the app-side
# JEDEC probe but works fine via the ROM driver the bootloader uses.
CONFIG_SPI_FLASH_ROM_IMPL=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
